components_camel-cxf-transport_src_test_java_org_apache_camel_component_cxf_cxfbean_CxfBeanWithWsdlLocationInBeanAndIoCTest.java/[CN]/CxfBeanWithWsdlLocationInBeanAndIoCTest/[MT]/testDoNotUseWsdlDefinedInJaxWsBeanByDefault()/body

{
  HttpPost post=new HttpPost("http://localhost:9090/customerservice/customers");
  post.addHeader("Accept","text/xml");
  String body="<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">" + "<soap:Body><GetPerson xmlns=\"http://camel.apache.org/wsdl-first/types\">" + "<personId>hello</personId></GetPerson></soap:Body></soap:Envelope>";
  StringEntity entity=new StringEntity(body,"text/xml","ISO-8859-1");
  post.setEntity(entity);
  HttpClient httpclient=new DefaultHttpClient();
  try {
    HttpResponse response=httpclient.execute(post);
    assertEquals(200,response.getStatusLine().getStatusCode());
    String responseBody=EntityUtils.toString(response.getEntity());
    String correct="<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap:Body>" + "<GetPersonResponse xmlns=\"http://camel.apache.org/wsdl-first/types\">" + "<personId>hello</personId><ssn>000-000-0000</ssn><name>Bye</name></GetPersonResponse></soap:Body></soap:Envelope>";
    assertEquals("Get a wrong response",correct,responseBody);
  }
  finally {
    httpclient.getConnectionManager().shutdown();
  }
}
